RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_pwc.c
/******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_pwc.c
 **
 ** A detailed description is available at
 ** @link PwcGroup PWC description @endlink
 **
 **   - 2018-10-28  CDT  First version for Device Driver Library of PWC.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_pwc.h"
#include "hc32f460_utility.h"

#if (DDL_PWC_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup PwcGroup
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define ENABLE_FCG0_REG_WRITE()             (M4_MSTP->FCG0PC = 0xa5a50001u)
#define DISABLE_FCG0_REG_WRITE()            (M4_MSTP->FCG0PC = 0xa5a50000u)

#define ENABLE_PWR_REG0_WRITE()             (M4_SYSREG->PWR_FPRC |= 0xa503u)
#define DISABLE_PWR_REG0_WRITE()            (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~3u))))

#define ENABLE_PWR_REG_WRITE()              (M4_SYSREG->PWR_FPRC |= 0xa502u)
#define DISABLE_PWR_REG_WRITE()             (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~2u))))

#define ENABLE_PVD_REG_WRITE()              (M4_SYSREG->PWR_FPRC |= 0xa508u)
#define DISABLE_PVD_REG_WRITE()             (M4_SYSREG->PWR_FPRC = (0xa500u | (M4_SYSREG->PWR_FPRC & (uint16_t)(~8u))))

/*! Parameter validity check for wake up event. */
#define IS_PWC_WKUP_EVENT(evt)              ((0x00u) != ((evt) & (0xFF)))

/*! Parameter validity check for wake up event. */
#define IS_PWC_WKUP2_EVENT(evt)             ((0x00u) != ((evt) & (0xB7)))

#define IS_PWC_WKUP_EDGE_EVENT(evt)         ((0x00u) != ((evt) & (0x7F)))

/*! Parameter validity check for wake up flag. */
#define IS_PWC_WKUP0_FLAG(flag)             ((0x00u) != ((flag) & (0x7F)))

/*! Parameter validity check for wake up flag. */
#define IS_PWC_WKUP1_FLAG(flag)             ((0x07u) != ((flag) & (0xB8)))

/*! Parameter validity check for power down mode. */
#define IS_PWC_PWR_DOWN_MODE(md)                                               \
(   ((md) == PowerDownMd1)              ||                                     \
    ((md) == PowerDownMd2)              ||                                     \
    ((md) == PowerDownMd3)              ||                                     \
    ((md) == PowerDownMd4))

/*! Parameter validity check for power down wake_up time control. */
#define IS_PWC_PWR_DOWN_WKUP_TIM(x)                                            \
(   ((x) == Vcap01)                     ||                                     \
    ((x) == Vcap0047))

/*! Parameter validity check for IO retain state while power down. */
#define IS_PWC_PWR_DWON_IO_STATE(x)                                            \
(   ((x) == IoPwrDownRetain)            ||                                     \
    ((x) == IoPwrRstRetain)             ||                                     \
    ((x) == IoHighImp))

/*! Parameter validity check for driver ability while enter stop mode. */
#define IS_PWC_STP_DRIVER_ABILITY(x)                                           \
(   ((x) == StopHighspeed)              ||                                     \
    ((x) == StopUlowspeed))

/*! Parameter validity check for driver ability. */
#define IS_PWC_DRIVER_ABILITY(x)                                               \
(   ((x) == Ulowspeed)                  ||                                     \
    ((x) == HighSpeed))

/*! Parameter validity check for dynamic voltage. */
#define IS_PWC_DYNAMIC_VOLTAGE(val)                                            \
(   ((val) == RunUHighspeed)            ||                                     \
    ((val) == RunUlowspeed)             ||                                     \
    ((val) == RunHighspeed))

/*! Parameter validity check for wake_up edge. */
#define IS_PWC_EDGE_SEL(edg)                                                   \
(   ((edg) == EdgeFalling)              ||                                     \
    ((edg) == EdgeRising))

/*! Parameter validity check for peripheral in fcg0. */
#define IS_PWC_FCG0_PERIPH(per)                                                \
(   (((per) & (0x700C3AEEu)) == (0x00u))  &&                                   \
    ((0x00u) != (per)))

/*! Parameter validity check for peripheral in fcg1. */
#define IS_PWC_FCG1_PERIPH(per)                                                \
(   (((per) & (0xF0F00286u)) == (0x00u))  &&                                     \
    ((0x00u) != (per)))

/*! Parameter validity check for peripheral in fcg2. */
#define IS_PWC_FCG2_PERIPH(per)                                                \
(   (((per) & (0xFFF87800u)) == (0x00u))  &&                                   \
    ((0x00u) != (per)))

/*! Parameter validity check for peripheral in fcg3. */
#define IS_PWC_FCG3_PERIPH(per)                                                \
(   (((per) & (0xFFFFEEECu)) == (0x00u))  &&                                   \
    ((0x00u) != (per)))

/*! Parameter validity check for clock value while stop mode mode. */
#define IS_PWC_STOP_MODE_CLK(clk)                                              \
(   ((clk) == ClkFix)                   ||                                     \
    ((clk) == ClkMrc))

/*! Parameter validity check for flash mode while stop mode mode. */
#define IS_PWC_STOP_MODE_FLASH(x)                                              \
(   ((x) == Wait)                       ||                                     \
    ((x) == NotWait))

/*! Parameter validity check for wake_up timer over flag. */
#define IS_PWC_WKTMOVER_FLAG(flag)                                             \
(   ((flag) == UnEqual)                 ||                                     \
    ((flag) == Equal))

/*! Parameter validity check for ram operate mode. */
#define IS_PWC_RAM_OP_MD(x)                                                    \
(   ((x) == HighSpeedMd)                ||                                     \
    ((x) == UlowSpeedMd))

/*! Parameter validity check for wake_up timer clock. */
#define IS_PWC_WKTM_CLK(clk)                                                   \
(   ((clk) == Wk64hz)                   ||                                     \
    ((clk) == WkXtal32)                 ||                                     \
    ((clk) == WkLrc))


/*! Parameter validity check for handle of pvd. */
#define IS_PWC_PVD_MD(x)                                                       \
(   ((x) == PvdInt)                     ||                                     \
    ((x) == PvdReset))


/*! Parameter validity check for pvd1 level. */
#define IS_PWC_PVD_FILTER_CLK(clk)                                             \
(   ((clk) == PvdLrc025)                ||                                     \
    ((clk) == PvdLrc05)                 ||                                     \
    ((clk) == PvdLrc1)                  ||                                     \
    ((clk) == PvdLrc2))

/*! Parameter validity check for pvd2 level. */
#define IS_PWC_PVD2_LEVEL(lvl)                                                 \
(   ((lvl) == Pvd2Level0)               ||                                     \
    ((lvl) == Pvd2Level1)               ||                                     \
    ((lvl) == Pvd2Level2)               ||                                     \
    ((lvl) == Pvd2Level3)               ||                                     \
    ((lvl) == Pvd2Level4)               ||                                     \
    ((lvl) == Pvd2Level5)               ||                                     \
    ((lvl) == Pvd2Level6)               ||                                     \
    ((lvl) == Pvd2Level7))

/*! Parameter validity check for pvd1 level. */
#define IS_PWC_PVD1_LEVEL(lvl)                                                 \
(   ((lvl) == Pvd1Level0)               ||                                     \
    ((lvl) == Pvd1Level1)               ||                                     \
    ((lvl) == Pvd1Level2)               ||                                     \
    ((lvl) == Pvd1Level3)               ||                                     \
    ((lvl) == Pvd1Level4)               ||                                     \
    ((lvl) == Pvd1Level5)               ||                                     \
    ((lvl) == Pvd1Level6)               ||                                     \
    ((lvl) == Pvd1Level7))

/*! Parameter validity check for pvd interrupt. */
#define IS_PWC_PVD_INT_SEL(x)                                                  \
(   ((x) == NonMskInt)                  ||                                     \
    ((x) == MskInt))

/*! Parameter validity check for valid wakeup source from stop mode. */
#define IS_VALID_WKUP_SRC(x)                                                    \
(   ((x) == INT_USART1_WUPI)                    ||                              \
    ((x) == INT_TMR01_GCMA)                     ||                              \
    ((x) == INT_RTC_ALM)                        ||                              \
    ((x) == INT_RTC_PRD)                        ||                              \
    ((x) == INT_WKTM_PRD)                       ||                              \
    ((x) == INT_ACMP1)                          ||                              \
    ((x) == INT_PVD_PVD1)                       ||                              \
    ((x) == INT_PVD_PVD2)                       ||                              \
    ((x) == INT_SWDT_REFUDF)                    ||                              \
    ((x) == INT_PORT_EIRQ0)                     ||                              \
    ((x) == INT_PORT_EIRQ1)                     ||                              \
    ((x) == INT_PORT_EIRQ2)                     ||                              \
    ((x) == INT_PORT_EIRQ3)                     ||                              \
    ((x) == INT_PORT_EIRQ4)                     ||                              \
    ((x) == INT_PORT_EIRQ5)                     ||                              \
    ((x) == INT_PORT_EIRQ6)                     ||                              \
    ((x) == INT_PORT_EIRQ7)                     ||                              \
    ((x) == INT_PORT_EIRQ8)                     ||                              \
    ((x) == INT_PORT_EIRQ9)                     ||                              \
    ((x) == INT_PORT_EIRQ10)                    ||                              \
    ((x) == INT_PORT_EIRQ11)                    ||                              \
    ((x) == INT_PORT_EIRQ12)                    ||                              \
    ((x) == INT_PORT_EIRQ13)                    ||                              \
    ((x) == INT_PORT_EIRQ14)                    ||                              \
    ((x) == INT_PORT_EIRQ15))

