RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_pwc.c
    M4_SYSREG->CMU_CKSWR_f.CKSW = u8SysSrc;

    DISABLE_PWR_REG0_WRITE();

    /* update system clock frequency. */
    SystemCoreClockUpdate();

    Ddl_Delay1us(1ul);

    /* Open fcg0~fcg3. */
    M4_MSTP->FCG0 = fcg0;
    M4_MSTP->FCG1 = fcg1;
    M4_MSTP->FCG2 = fcg2;
    M4_MSTP->FCG3 = fcg3;

    Ddl_Delay1us(1ul);
}
/**
 *******************************************************************************
 ** \brief  Backup HRC/MRC state and system clock , enable HRC/MRC ,set MRC as
 **         system clock before enter stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
static void PWC_enClockBackup(void)
{
    __IO uint32_t timeout = 0ul;
    en_flag_status_t status = Reset;

    /* HRC state backup. */
    u8HrcState = (uint8_t)bM4_SYSREG_CMU_HRCCR_HRCSTP;
    /* System clock backup*/
    u8SysClkSrc = M4_SYSREG->CMU_CKSWR_f.CKSW;

    ENABLE_PWR_REG0_WRITE();

    /* Enable HRC  before enter stop mode. */
    if(0u != u8HrcState)
    {
        bM4_SYSREG_CMU_HRCCR_HRCSTP = 0u;
        do
        {
            status = (en_flag_status_t)M4_SYSREG->CMU_OSCSTBSR_f.HRCSTBF;
            timeout++;
        }while((timeout < 0x1000ul) && (status != Set));
    }
    else
    {
        /* code */
    }
    /* When system clock source is HRC and MPLL, set MRC as system clock. . */
    if((0u == u8SysClkSrc) || (5u == u8SysClkSrc))
    {
        /* MRC state backup. */
        u8MrcState = (uint8_t)bM4_SYSREG_CMU_MRCCR_MRCSTP;
        if(0u != u8MrcState)
        {
            bM4_SYSREG_CMU_MRCCR_MRCSTP = 0u;
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
        PWC_SetSysClk(1u);
    }
    else
    {
        /* code */
    }

    DISABLE_PWR_REG0_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Recover HRC/MRC state and system clock after wakeup stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
static void PWC_enClockRecover(void)
{
    ENABLE_PWR_REG0_WRITE();

    if((0u == u8SysClkSrc) || (5u == u8SysClkSrc))
    {
        /* Recover MRC state & system clock source. */
        M4_SYSREG->CMU_MRCCR_f.MRCSTP = u8MrcState;
        PWC_SetSysClk(u8SysClkSrc);
    }
    /* Recover HRC state after wakeup stop mode. */
    M4_SYSREG->CMU_HRCCR_f.HRCSTP = u8HrcState;

    DISABLE_PWR_REG0_WRITE();
}

/**
 *******************************************************************************
 ** \brief  Clock backup before enter stop mode and mark it.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called before func. PWC_EnterStopMd.
 ******************************************************************************/
void PWC_ClkBackup(void)
{
    /* Disable all interrupt to ensure the following operation continued. */
    __disable_irq();

    /* HRC/MRC backup and switch system clock as MRC before entry from stop mode. */
    PWC_enClockBackup();

    /* Mark the system clock has been switch as MRC, and will enter the stop mode. */
    u8StopFlag = 1u;

    /* Enable all interrupt. */
    __enable_irq();
}

/**
 *******************************************************************************
 ** \brief  Clock recover after wakeup stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called after func. PWC_EnterStopMd.
 ******************************************************************************/
void PWC_ClkRecover(void)
{
    /* Disable all interrupt to ensure the following operation continued. */
    __disable_irq();

    /* Mark the system clock will be switch as MRC, and has waked_up from stop mode. */
    u8StopFlag = 0u;

    /* Recover HRC/MRC state and system clock after wakeup stop mode. */
    PWC_enClockRecover();

    /* Enable all interrupt. */
    __enable_irq();
}

/**
 *******************************************************************************
 ** \brief  Clock backup before exit wakup interrupt.
 **
 ** \param  None
 **
 ** \retval None
 **
 ** \note   This function should be called before exit wakup interrput.
 ******************************************************************************/
void PWC_IrqClkBackup(void)
{
    if((1ul == u8StopFlag) && (1ul == u8WkupIntCnt))
    {
         /* HRC/MRC backup and switch system clock as MRC. */
        PWC_enClockBackup();
    }
    u8WkupIntCnt--;
}

/**
 *******************************************************************************
 ** \brief  Clock recover after enter wakeup interrupt.
 **
 ** \param  None
 **
 ** \retval None
 **
** \note   This function should be called after enter wakup interrput.
 ******************************************************************************/
void PWC_IrqClkRecover(void)
{
    /* The varibale to display how many waked_up interrupt has been occured
       simultaneously and to decided whether backup clock before exit wake_up
       interrupt. */
    u8WkupIntCnt++;

    if(1ul == u8StopFlag)
    {
        /* Recover HRC/MRC state and system clock. */
        PWC_enClockRecover();
    }
}

/**
 *******************************************************************************
 ** \brief  Enter stop mode.
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void PWC_EnterStopMd(void)
{
    /* NVIC backup and disable before entry from stop mode.*/
    PWC_enNvicBackup();
    /* Clock backup and switch system clock as MRC before entry from stop mode. */
    PWC_ClkBackup();

    ENABLE_PWR_REG0_WRITE();

    M4_SYSREG->PWR_STPMCR_f.STOP = 1u;
    M4_SYSREG->PWR_PWRC0_f.PWDN = 0u;

    DISABLE_PWR_REG0_WRITE();

    __WFI();

    /* Recover HRC/MRC state and system clock after wakeup from stop mode. */
    PWC_ClkRecover();
    /* NVIC recover after wakeup from stop mode. */
    PWC_enNvicRecover();
}

/**
 *******************************************************************************
 ** \brief  Switch MCU from low_speed (HCLK < 8MHz) to high-speed (HCLK > 8MHz) mode.
 **
 ** \param  None
 **
 ** \retval Ok:     Mode switch sucessfully.
 **
 ** \note   Called after clock is ready.
 ******************************************************************************/
en_result_t PWC_HS2LS(void)
{
    uint32_t u32To = 10000ul;

    if(0ul == M4_EFM->FAPRT)
    {
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x3210ul;
        M4_EFM->FRMC_f.LVM = 1u;
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x0123ul;
    }
    else
    {
        M4_EFM->FRMC_f.LVM = 1u;
    }

    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_RAMOPM = 0x9062u;
    while((0x9062 != M4_SYSREG->PWR_RAMOPM) || (1u != M4_EFM->FRMC_f.LVM))
    {
        if (0ul == u32To--)
        {
            return Error;
        }
    }
    M4_SYSREG->PWR_PWRC2 = 0xE1U;
    M4_SYSREG->PWR_MDSWCR = 0x10U;
    DISABLE_PWR_REG_WRITE();

    Ddl_Delay1ms(1ul);

    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Switch MCU from high-speed (HCLK > 8MHz) to low_speed (HCLK < 8MHz) mode.
 **
 ** \param  None
 **
 ** \retval Ok:     Mode switch sucessfully.
 **         Error:  Mode switch failure.
 **
 ** \note   Called before clock is ready.
 ******************************************************************************/
en_result_t PWC_LS2HS(void)
{
    uint32_t u32To = 10000ul;

    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_PWRC2 = 0xFFU;
    M4_SYSREG->PWR_MDSWCR = 0x10U;

    Ddl_Delay1ms(1ul);

    if(0ul == M4_EFM->FAPRT)
    {
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x3210ul;
        M4_EFM->FRMC_f.LVM = 0u;
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x0123ul;
    }
    else
    {
        M4_EFM->FRMC_f.LVM = 0u;
    }

    M4_SYSREG->PWR_RAMOPM = 0x8043u;
    while((0x8043 != M4_SYSREG->PWR_RAMOPM) || (0u != M4_EFM->FRMC_f.LVM))
    {
        if (0ul == u32To--)
        {
            return Error;
        }
    }

    DISABLE_PWR_REG_WRITE();

    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Switch MCU from high-speed (HCLK > 8MHz) to high-performance mode.
 **
 ** \param  None
 **
 ** \retval Ok:     Mode switch sucessfully.
 **         Error:  Mode switch failure.
 **
 ** \note   Called before clock is ready.
 ******************************************************************************/
en_result_t PWC_HS2HP(void)
{
    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_PWRC2 = 0xCFU;
    M4_SYSREG->PWR_MDSWCR = 0x10U;
    DISABLE_PWR_REG_WRITE();
    Ddl_Delay1ms(1ul);

    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Switch MCU from high-performance to high-speed (HCLK > 8MHz) mode.
 **
 ** \param  None
 **
 ** \retval Ok:     Mode switch sucessfully.
 **         Error:  Mode switch failure.
 **
 ** \note   Called after clock is ready.
 ******************************************************************************/
en_result_t PWC_HP2HS(void)
{
    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_PWRC2 = 0xFFU;
    M4_SYSREG->PWR_MDSWCR = 0x10U;
    DISABLE_PWR_REG_WRITE();
    Ddl_Delay1ms(1ul);

    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Switch MCU from low-speed (HCLK <= 8MHz) to high-performance mode.
 **
 ** \param  None
 **
 ** \retval Ok:     Mode switch sucessfully.
 **         Error:  Mode switch failure.
 **
 ** \note   Called before clock is ready.
 ******************************************************************************/
en_result_t PWC_LS2HP(void)
{
    uint32_t u32To = 10000ul;

    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_PWRC2 = 0xCFU;
    M4_SYSREG->PWR_MDSWCR = 0x10U;

    Ddl_Delay1ms(1);

    if(0ul == M4_EFM->FAPRT)
    {
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x3210ul;
        M4_EFM->FRMC_f.LVM = 0u;
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x0123ul;
    }
    else
    {
        M4_EFM->FRMC_f.LVM = 0u;
    }

    M4_SYSREG->PWR_RAMOPM = 0x8043u;
    while((0x8043 != M4_SYSREG->PWR_RAMOPM) || (0u != M4_EFM->FRMC_f.LVM))
    {
        if (0ul == u32To--)
        {
            return Error;
        }
    }

    DISABLE_PWR_REG_WRITE();

    return Ok;
}

/**
 *******************************************************************************
 ** \brief  Switch MCU from high-performance to low-speed (HCLK <= 8MHz) mode.
 **
 ** \param  None
 **
 ** \retval Ok:     Mode switch sucessfully.
 **         Error:  Mode switch failure.
 **
 ** \note   Called after clock is ready.
 ******************************************************************************/
en_result_t PWC_HP2LS(void)
{
    uint32_t u32To = 10000ul;

    if(0ul == M4_EFM->FAPRT)
    {
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x3210ul;
        M4_EFM->FRMC_f.LVM = 1u;
        M4_EFM->FAPRT = 0x0123ul;
        M4_EFM->FAPRT = 0x0123ul;
    }
    else
    {
        M4_EFM->FRMC_f.LVM = 1u;
    }

    ENABLE_PWR_REG_WRITE();
    M4_SYSREG->PWR_RAMOPM = 0x9062u;
    u32To = 10000ul;
    while((0x9062 != M4_SYSREG->PWR_RAMOPM) || (1u != M4_EFM->FRMC_f.LVM))
    {
        if (0ul == u32To--)
        {
            return Error;
        }
    }

    M4_SYSREG->PWR_PWRC2 = 0xD1U;
    M4_SYSREG->PWR_MDSWCR = 0x10U;

    DISABLE_PWR_REG_WRITE();

    Ddl_Delay1ms(1);

    return Ok;
}

#endif /* DDL_PWC_ENABLE */

//@} // PwcGroup

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
